Revit 2024 API
BuiltInFailures.PerformanceFailures.LargeFamilyFile Property
 Family occupies XXX kilobytes of memory. Consider simplification of the family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LargeFamilyFile { get; }
Visual Basic
Public Shared ReadOnly Property LargeFamilyFile As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LargeFamilyFile {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace